import { Link } from "react-router-dom"
import "./o-nas.css"

export default function ONas() {
  return (
    <div>
      <div className="info-button">
        <button disabled={true}>←</button>

        <h1>О нас</h1>

        <Link to="/svaz-s-nami">
          <button>→</button>
        </Link>
      </div>

      <div className="info-block">
        <h1>О нас</h1>

        <ul>
          <li>Добро пожаловать в наш интернет-магазин! Мы создаем удобное, современное и надежное пространство для тех, кто ценит качество, стиль и комфортные онлайн-покупки.</li>

          <li>Наша главная цель — сделать ваш шопинг максимально быстрым, понятным и приятным. Мы тщательно подбираем ассортимент, следим за актуальными трендами и уделяем внимание каждой детали, чтобы вы возвращались к нам снова и снова.</li>
        </ul>


        <h1 className="top-h1">Кто стоит за проектом?</h1>

        <p className="p1">За технической безупречностью, красотой и удобством нашего сайта стоит основатель и главный разработчик:</p>

        <ul>
          <li>Иминов Абдумуталлиб — Web-developer / Разработчик проекта</li>
        </ul>

        <div className="my-info">
          «Я верю, что хороший интернет-магазин — это не просто каталог товаров, а удобный сервис, созданный с заботой о пользователе. Каждая функция, кнопка и страница нашего сайта спроектированы так, чтобы ваши покупки совершались легко и за считанные клики.»
        </div>

        <h1 className="top-h1">Почему выбирают нас?</h1>

        <ul>
          <li>Удобство на любом устройстве: JUZ MARKET всегда под рукой — совершайте покупки с максимальным комфортом со смартфона, планшета или компьютера. Мгновенная загрузка, продуманная навигация и безупречный интерфейс для вашего быстрого шопинга.</li>

          <li>Качество и надежность: Мы гарантируем безопасность ваших данных и высокий уровень сервиса на каждом этапе заказа.</li>

          <li>Забота о клиентах: Наша команда всегда готова помочь вам с выбором и ответить на любые вопросы.</li>
        </ul>
      </div>
    </div>
  )
}
